#include <stdio.h>

int main(void)
{
    /*
        Сдвиги бит вправо образуют целочисленное деление
        Сдвиги бит влево образуют целочисленное умножение
    */
    unsigned char x = 40;       // 00101000 = 40
    printf("x = %d\n", x);

    x = x >> 1;
    printf("x = %d\n", x);      // 00010100 = 20. Эквивалентно целочисленному делению на 2

    x = x >> 2;
    printf("x = %d\n", x);      // 00000101 = 5. Эквивалентно целочисленному делению на 4

    x = x >> 1;
    printf("x = %d\n", x);      // 00000010

    x = x >> 1;
    printf("x = %d\n", x);      // 00000001

    x = x << 1;
    printf("x = %d\n", x);      // 00000010. Эквивалентно умножению на 2

    x = x << 2;
    printf("x = %d\n", x);      // 00001000. Эквивалентно умножению на 4


    /*
        У знаковых чисел старший бит отводится под знак [-128; 127]
    */
    signed char y = -128;       // 1000 0000
    printf("y = %d\n", y);

    y = y << 1;                 // 0000 0000
    printf("y = %d\n", y);

    // сдвиг влево на 1 = целочисленному делению на 2
    y = -128;                   // 1000 0000
    y = y >> 1;                 // 1100 0000 = -64
    printf("y = %d\n", y);   

    return 0;
}